; domain
(define (domain grid-visit-all)
(:requirements :typing)
(:types        place - object)
(:predicates (connected ?x ?y - place)
	     (at-robot ?x - place)
	     (visited ?x - place)
)
	
(:action move
:parameters (?curpos ?nextpos - place)
:precondition (and (at-robot ?curpos) (connected ?curpos ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos)) (visited ?nextpos))
)

)

; problem
(define (problem grid-7)
(:domain grid-visit-all)
(:objects 
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x0-y3
	loc-x0-y4
	loc-x0-y5
	loc-x0-y6
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x1-y3
	loc-x1-y4
	loc-x1-y5
	loc-x1-y6
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
	loc-x2-y3
	loc-x2-y4
	loc-x2-y5
	loc-x2-y6
	loc-x3-y0
	loc-x3-y1
	loc-x3-y2
	loc-x3-y3
	loc-x3-y4
	loc-x3-y5
	loc-x3-y6
	loc-x4-y0
	loc-x4-y1
	loc-x4-y2
	loc-x4-y3
	loc-x4-y4
	loc-x4-y5
	loc-x4-y6
	loc-x5-y0
	loc-x5-y1
	loc-x5-y2
	loc-x5-y3
	loc-x5-y4
	loc-x5-y5
	loc-x5-y6
	loc-x6-y0
	loc-x6-y1
	loc-x6-y2
	loc-x6-y3
	loc-x6-y4
	loc-x6-y5
	loc-x6-y6
- place 
        
)
(:init
	(at-robot loc-x3-y3)
	(visited loc-x3-y3)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x0-y2 loc-x0-y3)
 	(connected loc-x0-y3 loc-x1-y3)
 	(connected loc-x0-y3 loc-x0-y2)
 	(connected loc-x0-y3 loc-x0-y4)
 	(connected loc-x0-y4 loc-x1-y4)
 	(connected loc-x0-y4 loc-x0-y3)
 	(connected loc-x0-y4 loc-x0-y5)
 	(connected loc-x0-y5 loc-x1-y5)
 	(connected loc-x0-y5 loc-x0-y4)
 	(connected loc-x0-y5 loc-x0-y6)
 	(connected loc-x0-y6 loc-x1-y6)
 	(connected loc-x0-y6 loc-x0-y5)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x1-y2 loc-x1-y3)
 	(connected loc-x1-y3 loc-x0-y3)
 	(connected loc-x1-y3 loc-x2-y3)
 	(connected loc-x1-y3 loc-x1-y2)
 	(connected loc-x1-y3 loc-x1-y4)
 	(connected loc-x1-y4 loc-x0-y4)
 	(connected loc-x1-y4 loc-x2-y4)
 	(connected loc-x1-y4 loc-x1-y3)
 	(connected loc-x1-y4 loc-x1-y5)
 	(connected loc-x1-y5 loc-x0-y5)
 	(connected loc-x1-y5 loc-x2-y5)
 	(connected loc-x1-y5 loc-x1-y4)
 	(connected loc-x1-y5 loc-x1-y6)
 	(connected loc-x1-y6 loc-x0-y6)
 	(connected loc-x1-y6 loc-x2-y6)
 	(connected loc-x1-y6 loc-x1-y5)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x3-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x3-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x3-y2)
 	(connected loc-x2-y2 loc-x2-y1)
 	(connected loc-x2-y2 loc-x2-y3)
 	(connected loc-x2-y3 loc-x1-y3)
 	(connected loc-x2-y3 loc-x3-y3)
 	(connected loc-x2-y3 loc-x2-y2)
 	(connected loc-x2-y3 loc-x2-y4)
 	(connected loc-x2-y4 loc-x1-y4)
 	(connected loc-x2-y4 loc-x3-y4)
 	(connected loc-x2-y4 loc-x2-y3)
 	(connected loc-x2-y4 loc-x2-y5)
 	(connected loc-x2-y5 loc-x1-y5)
 	(connected loc-x2-y5 loc-x3-y5)
 	(connected loc-x2-y5 loc-x2-y4)
 	(connected loc-x2-y5 loc-x2-y6)
 	(connected loc-x2-y6 loc-x1-y6)
 	(connected loc-x2-y6 loc-x3-y6)
 	(connected loc-x2-y6 loc-x2-y5)
 	(connected loc-x3-y0 loc-x2-y0)
 	(connected loc-x3-y0 loc-x4-y0)
 	(connected loc-x3-y0 loc-x3-y1)
 	(connected loc-x3-y1 loc-x2-y1)
 	(connected loc-x3-y1 loc-x4-y1)
 	(connected loc-x3-y1 loc-x3-y0)
 	(connected loc-x3-y1 loc-x3-y2)
 	(connected loc-x3-y2 loc-x2-y2)
 	(connected loc-x3-y2 loc-x4-y2)
 	(connected loc-x3-y2 loc-x3-y1)
 	(connected loc-x3-y2 loc-x3-y3)
 	(connected loc-x3-y3 loc-x2-y3)
 	(connected loc-x3-y3 loc-x4-y3)
 	(connected loc-x3-y3 loc-x3-y2)
 	(connected loc-x3-y3 loc-x3-y4)
 	(connected loc-x3-y4 loc-x2-y4)
 	(connected loc-x3-y4 loc-x4-y4)
 	(connected loc-x3-y4 loc-x3-y3)
 	(connected loc-x3-y4 loc-x3-y5)
 	(connected loc-x3-y5 loc-x2-y5)
 	(connected loc-x3-y5 loc-x4-y5)
 	(connected loc-x3-y5 loc-x3-y4)
 	(connected loc-x3-y5 loc-x3-y6)
 	(connected loc-x3-y6 loc-x2-y6)
 	(connected loc-x3-y6 loc-x4-y6)
 	(connected loc-x3-y6 loc-x3-y5)
 	(connected loc-x4-y0 loc-x3-y0)
 	(connected loc-x4-y0 loc-x5-y0)
 	(connected loc-x4-y0 loc-x4-y1)
 	(connected loc-x4-y1 loc-x3-y1)
 	(connected loc-x4-y1 loc-x5-y1)
 	(connected loc-x4-y1 loc-x4-y0)
 	(connected loc-x4-y1 loc-x4-y2)
 	(connected loc-x4-y2 loc-x3-y2)
 	(connected loc-x4-y2 loc-x5-y2)
 	(connected loc-x4-y2 loc-x4-y1)
 	(connected loc-x4-y2 loc-x4-y3)
 	(connected loc-x4-y3 loc-x3-y3)
 	(connected loc-x4-y3 loc-x5-y3)
 	(connected loc-x4-y3 loc-x4-y2)
 	(connected loc-x4-y3 loc-x4-y4)
 	(connected loc-x4-y4 loc-x3-y4)
 	(connected loc-x4-y4 loc-x5-y4)
 	(connected loc-x4-y4 loc-x4-y3)
 	(connected loc-x4-y4 loc-x4-y5)
 	(connected loc-x4-y5 loc-x3-y5)
 	(connected loc-x4-y5 loc-x5-y5)
 	(connected loc-x4-y5 loc-x4-y4)
 	(connected loc-x4-y5 loc-x4-y6)
 	(connected loc-x4-y6 loc-x3-y6)
 	(connected loc-x4-y6 loc-x5-y6)
 	(connected loc-x4-y6 loc-x4-y5)
 	(connected loc-x5-y0 loc-x4-y0)
 	(connected loc-x5-y0 loc-x6-y0)
 	(connected loc-x5-y0 loc-x5-y1)
 	(connected loc-x5-y1 loc-x4-y1)
 	(connected loc-x5-y1 loc-x6-y1)
 	(connected loc-x5-y1 loc-x5-y0)
 	(connected loc-x5-y1 loc-x5-y2)
 	(connected loc-x5-y2 loc-x4-y2)
 	(connected loc-x5-y2 loc-x6-y2)
 	(connected loc-x5-y2 loc-x5-y1)
 	(connected loc-x5-y2 loc-x5-y3)
 	(connected loc-x5-y3 loc-x4-y3)
 	(connected loc-x5-y3 loc-x6-y3)
 	(connected loc-x5-y3 loc-x5-y2)
 	(connected loc-x5-y3 loc-x5-y4)
 	(connected loc-x5-y4 loc-x4-y4)
 	(connected loc-x5-y4 loc-x6-y4)
 	(connected loc-x5-y4 loc-x5-y3)
 	(connected loc-x5-y4 loc-x5-y5)
 	(connected loc-x5-y5 loc-x4-y5)
 	(connected loc-x5-y5 loc-x6-y5)
 	(connected loc-x5-y5 loc-x5-y4)
 	(connected loc-x5-y5 loc-x5-y6)
 	(connected loc-x5-y6 loc-x4-y6)
 	(connected loc-x5-y6 loc-x6-y6)
 	(connected loc-x5-y6 loc-x5-y5)
 	(connected loc-x6-y0 loc-x5-y0)
 	(connected loc-x6-y0 loc-x6-y1)
 	(connected loc-x6-y1 loc-x5-y1)
 	(connected loc-x6-y1 loc-x6-y0)
 	(connected loc-x6-y1 loc-x6-y2)
 	(connected loc-x6-y2 loc-x5-y2)
 	(connected loc-x6-y2 loc-x6-y1)
 	(connected loc-x6-y2 loc-x6-y3)
 	(connected loc-x6-y3 loc-x5-y3)
 	(connected loc-x6-y3 loc-x6-y2)
 	(connected loc-x6-y3 loc-x6-y4)
 	(connected loc-x6-y4 loc-x5-y4)
 	(connected loc-x6-y4 loc-x6-y3)
 	(connected loc-x6-y4 loc-x6-y5)
 	(connected loc-x6-y5 loc-x5-y5)
 	(connected loc-x6-y5 loc-x6-y4)
 	(connected loc-x6-y5 loc-x6-y6)
 	(connected loc-x6-y6 loc-x5-y6)
 	(connected loc-x6-y6 loc-x6-y5)
 
)
(:goal
(and 
	(visited loc-x0-y0)
	(visited loc-x0-y1)
	(visited loc-x0-y2)
	(visited loc-x0-y3)
	(visited loc-x0-y4)
	(visited loc-x0-y5)
	(visited loc-x0-y6)
	(visited loc-x1-y0)
	(visited loc-x1-y1)
	(visited loc-x1-y2)
	(visited loc-x1-y3)
	(visited loc-x1-y4)
	(visited loc-x1-y5)
	(visited loc-x1-y6)
	(visited loc-x2-y0)
	(visited loc-x2-y1)
	(visited loc-x2-y2)
	(visited loc-x2-y3)
	(visited loc-x2-y4)
	(visited loc-x2-y5)
	(visited loc-x2-y6)
	(visited loc-x3-y0)
	(visited loc-x3-y1)
	(visited loc-x3-y2)
	(visited loc-x3-y3)
	(visited loc-x3-y4)
	(visited loc-x3-y5)
	(visited loc-x3-y6)
	(visited loc-x4-y0)
	(visited loc-x4-y1)
	(visited loc-x4-y2)
	(visited loc-x4-y3)
	(visited loc-x4-y4)
	(visited loc-x4-y5)
	(visited loc-x4-y6)
	(visited loc-x5-y0)
	(visited loc-x5-y1)
	(visited loc-x5-y2)
	(visited loc-x5-y3)
	(visited loc-x5-y4)
	(visited loc-x5-y5)
	(visited loc-x5-y6)
	(visited loc-x6-y0)
	(visited loc-x6-y1)
	(visited loc-x6-y2)
	(visited loc-x6-y3)
	(visited loc-x6-y4)
	(visited loc-x6-y5)
	(visited loc-x6-y6)
)
)
)

; plan
1. (move loc-x3-y3 loc-x2-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x2-y3) (visited loc-x2-y3)
   goals met: 2 of 49
2. (move loc-x2-y3 loc-x1-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x1-y3) (visited loc-x1-y3)
   goals met: 3 of 49
3. (move loc-x1-y3 loc-x0-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x0-y3) (visited loc-x0-y3)
   goals met: 4 of 49
4. (move loc-x0-y3 loc-x0-y2)
   deleted: (at-robot loc-x0-y3)
   added: (at-robot loc-x0-y2) (visited loc-x0-y2)
   goals met: 5 of 49
5. (move loc-x0-y2 loc-x0-y1)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x0-y1) (visited loc-x0-y1)
   goals met: 6 of 49
6. (move loc-x0-y1 loc-x0-y0)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y0) (visited loc-x0-y0)
   goals met: 7 of 49
7. (move loc-x0-y0 loc-x1-y0)
   deleted: (at-robot loc-x0-y0)
   added: (at-robot loc-x1-y0) (visited loc-x1-y0)
   goals met: 8 of 49
8. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1) (visited loc-x1-y1)
   goals met: 9 of 49
9. (move loc-x1-y1 loc-x1-y2)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y2) (visited loc-x1-y2)
   goals met: 10 of 49
10. (move loc-x1-y2 loc-x2-y2)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x2-y2) (visited loc-x2-y2)
   goals met: 11 of 49
11. (move loc-x2-y2 loc-x2-y1)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y1) (visited loc-x2-y1)
   goals met: 12 of 49
12. (move loc-x2-y1 loc-x2-y0)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x2-y0) (visited loc-x2-y0)
   goals met: 13 of 49
13. (move loc-x2-y0 loc-x3-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x3-y0) (visited loc-x3-y0)
   goals met: 14 of 49
14. (move loc-x3-y0 loc-x3-y1)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x3-y1) (visited loc-x3-y1)
   goals met: 15 of 49
15. (move loc-x3-y1 loc-x4-y1)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x4-y1) (visited loc-x4-y1)
   goals met: 16 of 49
16. (move loc-x4-y1 loc-x4-y0)
   deleted: (at-robot loc-x4-y1)
   added: (at-robot loc-x4-y0) (visited loc-x4-y0)
   goals met: 17 of 49
17. (move loc-x4-y0 loc-x5-y0)
   deleted: (at-robot loc-x4-y0)
   added: (at-robot loc-x5-y0) (visited loc-x5-y0)
   goals met: 18 of 49
18. (move loc-x5-y0 loc-x5-y1)
   deleted: (at-robot loc-x5-y0)
   added: (at-robot loc-x5-y1) (visited loc-x5-y1)
   goals met: 19 of 49
19. (move loc-x5-y1 loc-x5-y2)
   deleted: (at-robot loc-x5-y1)
   added: (at-robot loc-x5-y2) (visited loc-x5-y2)
   goals met: 20 of 49
20. (move loc-x5-y2 loc-x4-y2)
   deleted: (at-robot loc-x5-y2)
   added: (at-robot loc-x4-y2) (visited loc-x4-y2)
   goals met: 21 of 49
21. (move loc-x4-y2 loc-x3-y2)
   deleted: (at-robot loc-x4-y2)
   added: (at-robot loc-x3-y2) (visited loc-x3-y2)
   goals met: 22 of 49
22. (move loc-x3-y2 loc-x3-y3)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x3-y3)
   goals met: 22 of 49
23. (move loc-x3-y3 loc-x3-y4)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y4) (visited loc-x3-y4)
   goals met: 23 of 49
24. (move loc-x3-y4 loc-x2-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x2-y4) (visited loc-x2-y4)
   goals met: 24 of 49
25. (move loc-x2-y4 loc-x1-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x1-y4) (visited loc-x1-y4)
   goals met: 25 of 49
26. (move loc-x1-y4 loc-x0-y4)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x0-y4) (visited loc-x0-y4)
   goals met: 26 of 49
27. (move loc-x0-y4 loc-x0-y5)
   deleted: (at-robot loc-x0-y4)
   added: (at-robot loc-x0-y5) (visited loc-x0-y5)
   goals met: 27 of 49
28. (move loc-x0-y5 loc-x0-y6)
   deleted: (at-robot loc-x0-y5)
   added: (at-robot loc-x0-y6) (visited loc-x0-y6)
   goals met: 28 of 49
29. (move loc-x0-y6 loc-x1-y6)
   deleted: (at-robot loc-x0-y6)
   added: (at-robot loc-x1-y6) (visited loc-x1-y6)
   goals met: 29 of 49
30. (move loc-x1-y6 loc-x1-y5)
   deleted: (at-robot loc-x1-y6)
   added: (at-robot loc-x1-y5) (visited loc-x1-y5)
   goals met: 30 of 49
31. (move loc-x1-y5 loc-x2-y5)
   deleted: (at-robot loc-x1-y5)
   added: (at-robot loc-x2-y5) (visited loc-x2-y5)
   goals met: 31 of 49
32. (move loc-x2-y5 loc-x2-y6)
   deleted: (at-robot loc-x2-y5)
   added: (at-robot loc-x2-y6) (visited loc-x2-y6)
   goals met: 32 of 49
33. (move loc-x2-y6 loc-x3-y6)
   deleted: (at-robot loc-x2-y6)
   added: (at-robot loc-x3-y6) (visited loc-x3-y6)
   goals met: 33 of 49
34. (move loc-x3-y6 loc-x3-y5)
   deleted: (at-robot loc-x3-y6)
   added: (at-robot loc-x3-y5) (visited loc-x3-y5)
   goals met: 34 of 49
35. (move loc-x3-y5 loc-x3-y4)
   deleted: (at-robot loc-x3-y5)
   added: (at-robot loc-x3-y4)
   goals met: 34 of 49
36. (move loc-x3-y4 loc-x3-y3)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x3-y3)
   goals met: 34 of 49
37. (move loc-x3-y3 loc-x4-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x4-y3) (visited loc-x4-y3)
   goals met: 35 of 49
38. (move loc-x4-y3 loc-x4-y4)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x4-y4) (visited loc-x4-y4)
   goals met: 36 of 49
39. (move loc-x4-y4 loc-x4-y5)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x4-y5) (visited loc-x4-y5)
   goals met: 37 of 49
40. (move loc-x4-y5 loc-x4-y6)
   deleted: (at-robot loc-x4-y5)
   added: (at-robot loc-x4-y6) (visited loc-x4-y6)
   goals met: 38 of 49
41. (move loc-x4-y6 loc-x5-y6)
   deleted: (at-robot loc-x4-y6)
   added: (at-robot loc-x5-y6) (visited loc-x5-y6)
   goals met: 39 of 49
42. (move loc-x5-y6 loc-x5-y5)
   deleted: (at-robot loc-x5-y6)
   added: (at-robot loc-x5-y5) (visited loc-x5-y5)
   goals met: 40 of 49
43. (move loc-x5-y5 loc-x6-y5)
   deleted: (at-robot loc-x5-y5)
   added: (at-robot loc-x6-y5) (visited loc-x6-y5)
   goals met: 41 of 49
44. (move loc-x6-y5 loc-x6-y6)
   deleted: (at-robot loc-x6-y5)
   added: (at-robot loc-x6-y6) (visited loc-x6-y6)
   goals met: 42 of 49
45. (move loc-x6-y6 loc-x6-y5)
   deleted: (at-robot loc-x6-y6)
   added: (at-robot loc-x6-y5)
   goals met: 42 of 49
46. (move loc-x6-y5 loc-x6-y4)
   deleted: (at-robot loc-x6-y5)
   added: (at-robot loc-x6-y4) (visited loc-x6-y4)
   goals met: 43 of 49
47. (move loc-x6-y4 loc-x5-y4)
   deleted: (at-robot loc-x6-y4)
   added: (at-robot loc-x5-y4) (visited loc-x5-y4)
   goals met: 44 of 49
48. (move loc-x5-y4 loc-x5-y3)
   deleted: (at-robot loc-x5-y4)
   added: (at-robot loc-x5-y3) (visited loc-x5-y3)
   goals met: 45 of 49
49. (move loc-x5-y3 loc-x6-y3)
   deleted: (at-robot loc-x5-y3)
   added: (at-robot loc-x6-y3) (visited loc-x6-y3)
   goals met: 46 of 49
50. (move loc-x6-y3 loc-x6-y2)
   deleted: (at-robot loc-x6-y3)
   added: (at-robot loc-x6-y2) (visited loc-x6-y2)
   goals met: 47 of 49
51. (move loc-x6-y2 loc-x6-y1)
   deleted: (at-robot loc-x6-y2)
   added: (at-robot loc-x6-y1) (visited loc-x6-y1)
   goals met: 48 of 49
52. (move loc-x6-y1 loc-x6-y0)
   deleted: (at-robot loc-x6-y1)
   added: (at-robot loc-x6-y0) (visited loc-x6-y0)
   goals met: 49 of 49
